Repository: 84000/data-translation-memory
Catalog: Toh_144-Cultivating_Trust_in_the_Great_Vehicle-v.2.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་ནི་སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་དང་། གདུང་བར་བྱེད་པ་དང་། མྱ་ངན་གྱི་མེའི་གཉེན་པོར་གྱུར་པའི་ཕྱིར་ཆུ་ལྟ་བུར་བལྟའོ། །
en: “Trust in the Great Vehicle of the bodhisattvas should be viewed as water because it counteracts the fires of wailing, suffering, unhappiness, conflict, torment, and sorrow.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་ནི་མི་འདོད་པ་ཐམས་ཅད་དང་ཕྲད་པར་བྱེད་པའི་ཉོན་མོངས་པའི་དགྲའི་གཉེན་པོར་གྱུར་པའི་ཕྱིར་ལག་ཆ་བཟང་པོ་ལྟ་བུར་བལྟའོ། །
en: “Trust in the Great Vehicle of the bodhisattvas should be viewed as a fine tool because it is an antidote to the enemies of disturbing emotions that create unwanted situations.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་ནི་རྟག་པར་རྒྱུན་དུ་དཀར་པོའི་ཕྱོགས་ཀྱི་ཆོས་རྣམ་པར་འཕེལ་བའི་ཕྱིར་ཟླ་བ་ལྟ་བུར་བལྟའོ། །
en: “Trust in the Great Vehicle of the bodhisattvas should be viewed as the moon because it continuously increases the entirety of the wholesome Dharma.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་ནི་སེམས་ཅན་ཚད་མེད་པ་ལ་ཡེ་ཤེས་ཚད་མེད་པས་སྣང་བར་བྱ་བ་དང་འཐུན་པའི་ཕྱིར་ཉི་མ་ལྟ་བུར་བལྟའོ། །
en: “Trust in the Great Vehicle of the bodhisattvas should be viewed as the sun because it brings light to endless beings through limitless wisdom.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་ནི་དམ་པའི་ཆོས་ཀྱི་ཆར་ཚད་མེད་པ་འབེབས་པ་དང་འཐུན་པའི་ཕྱིར་སྤྲིན་ཆེན་པོ་ལྟ་བུར་བལྟའོ། །
en: “Trust in the Great Vehicle of the bodhisattvas should be viewed as a great cloud because it leads to the endless rain of Dharma.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་ནི་གཞན་མུ་སྟེགས་ཅན་དང་། ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་གཞོམ་པ་དང་འཐུན་པའི་ཕྱིར་ལྕེ་འབབ་པ་ལྟ་བུར་བལྟའོ། །
en: “Trust in the Great Vehicle of the bodhisattvas should be viewed as a lightning because it destroys all attacks from non-Buddhists and opposing forces.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་འཇོམས་པར་བྱེད་པ་དང་འཐུན་པའི་ཕྱིར་ལོ་ལེགས་པ་ལྟ་བུར་བལྟའོ། །
en: “Trust in the Great Vehicle of the bodhisattvas should be viewed as a bountiful harvest because it leads to conquering the obscurations of all beings.

source: རིགས་ཀྱི་བུ་ངས་མངོན་པར་ཤེས་ཏེ། འདས་པའི་དུས་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་ཚེ་རྒྱལ་པོའི་ཁབ་འདི་ཉིད་དུ་བུད་མེད་གྲོང་པའི་ཐ་ཆད་ཕྱག་དར་བྱེད་པ་ངན་འགྲོ་བ་ཞིག་བྱུང་སྟེ།
en: “Noble son, I clearly see that in the past, at the time of the perfect buddha Kāśyapa, right here in Rājagṛha, there lived an unfortunate woman who, being a sweeper, was the lowest in the village.

source: དེས་ཁྱིམ་བདག་ཆེ་གེ་མོ་ཞེས་བྱ་བ་ཞིག་གི་ཁྱིམ་དུ་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་སྤྱན་འདྲེན་ཅེས་ཐོས་ནས་
en: One day she heard that the Buddha and his assembly of monks had been requested to visit a certain householder’s property.

source: དེ་བཀྲེས་པ་དང་། སྐོམ་པས་ཉེན་པས་ཁྱིམ་བདག་དེའི་ཁྱིམ་ག་ལ་བ་དེར་སོང་བ་དང་།
en: Since she was tormented by hunger and thirst, she also went to where the householder lived.

source: དེར་འཁོར་གྱི་ཁྱམས་ན་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་རབ་ཏུ་ཞི་བའི་སྤྱོད་ལམ་དུ་གནས་པ་དང་བཤོས་འདྲིམ་པ་མཐོང་ངོ་། །
en: In the courtyard, she saw the Buddha and his assembly of monks sitting peacefully as their meals were being offered.

source: བུད་མེད་དེས་སྤྱོད་ལམ་ཕུན་སུམ་ཚོགས་པ་དེ་དང་ཚོགས་ཀྱིས་བསྐོར་བ་མཛེས་པ་དེ་ཡང་མཐོང་ནས།
en: As the woman beheld their perfect behavior and saw the Buddha sitting so beautifully, surrounded by his followers, she exclaimed,

source: ཀྱེ་མའོ་བཅོམ་ལྡན་འདས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་རབ་ཏུ་ཞི་བའི་སྤྱོད་ལམ་དང་། ཞབས་འབྲིང་བ་མཛེས་པས་མཛེས་སོ་ཞེས་དད་པའི་སེམས་གཅིག་བསྐྱེད་ནས་དེ་འཆི་བའི་དུས་བྱས་སོ། །
en: ‘Oh, the Blessed One, the perfect Buddha Kāśyapa is so beautiful to behold; he has such serene conduct and his followers are so graceful!’ Then, with this intense feeling of trust, she passed away.

source: དེ་རྒྱུ་དེ་ཉིད་ཀྱིས་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་ནང་དུ་སྐྱེས་པ་ནས་རྒྱུ་དེ་ཉིད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་གྱུར་པའི་བར་དུའོ། །
en: Now, because of this she was born in the Heaven of the Thirty-Three, and by this very cause she eventually achieved liberation in unsurpassed and completely perfect awakening.

source: རིགས་ཀྱི་བུ་ངས་མངོན་པར་ཤེས་ཏེ་འདས་པའི་དུས་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་ཀྱི་ཚེ་རྒྱལ་པོའི་ཁབ་འདི་ཉིད་དུ་ཟས་འདོད་ཅེས་བྱ་བའི་བྲམ་ཟེ་ཞིག་བྱུང་ངོ་། །
en: “Noble son, I clearly see that in the past, at the time of the perfect buddha Vipaśyin, right here in Rājagṛha, there lived a brahmin known as Hungry One.

source: ཟས་འདོད་དེ་སངས་རྒྱས་དང་། ཆོས་དང་དགེ་འདུན་དཀོན་མཆོག་ལ་རང་བཞིན་གྱིས་མ་དད་ན་བསྙེན་བཀུར་ལྟ་ག་ལ་ཞིག་བྱེད།
en: Hungry One had a natural distrust in the precious Buddha, Dharma, and Saṅgha, so he certainly had no interest in serving them either.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་རྒྱལ་པོའི་ཁབ་ཏུ་བསོད་སྙོམས་ཀྱི་ཕྱིར་གཤེགས་པ་དང་།
en: At that time the Blessed One, the perfect buddha Vipaśyin, arrived in Rājagṛha to collect alms.

source: བྲམ་ཟེ་དེ་ཡང་དོན་ཞིག་གཉེར་ཞིང་རྒྱལ་པོའི་ཁབ་ནས་བྱུང་ངོ་། །
en: Since the brahmin also had some affairs to attend to in Rājagṛha, he also went there.

source: དེ་བྱུང་བ་དང་བཅོམ་ལྡན་འདས་རྣམ་པར་གཟིགས་དེ་བཞིན་གཤེགས་པ་དེ་ཁས་བོན་དུ་མཐོང་ངོ་། །
en: When he arrived, he saw for himself the Thus-Gone One, the Blessed Vipaśyin.

source: མཐོང་ནས་ཀྱང་དེས་གཟུགས་མཛེས་པ་ལ་དམིགས་ཏེ།
en: As he beheld him, he noticed his beautiful appearance and said,

source: ཀྱེ་མའོ་བཅོམ་ལྡན་འདས་རྣམ་པར་གཟིགས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཚན་དང་དཔེ་བྱད་བཟང་པོ་རྣམས་ཀྱིས་སྐུ་ལེགས་པར་བརྒྱན་ཏོ་ཞེས་དད་པའི་སེམས་གཅིག་རྙེད་ནསདེ་འཆི་བའི་དུས་བྱས་སོ། །
en: ‘Oh, the body of the Blessed Vipaśyin is beautifully adorned with the excellent signs and marks of a thus-gone one, a worthy one, a perfect buddha!’ Having in this way gained a moment of trust, he passed away.

source: དེ་རྒྱུ་དེས་རབ་མཚེ་མའི་ལྷའི་ནང་དུ་སྐྱེས་པ་ནས་རྒྱུ་དེ་ཉིད་ཀྱིས་རིམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་གྱུར་པའི་བར་དུའོ། །
en: As a result of that trust he was born among the gods in the Yāma Heaven, and through that very cause he gradually progressed toward the liberation of unexcelled and completely perfect awakening.

source: རིགས་ཀྱི་བུ་ངས་མངོན་པར་ཤེས་ཏེའདས་པའི་དུས་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་ཚེ་རྒྱལ་པོའི་ཁབ་འདི་ཉིད་དུ་གཞན་མུ་སྟེགས་ཅན་ལྔ་བརྒྱ་ཞིག་བྱུང་སྟེ།
en: “Noble son, I clearly see that in the past, at the time of the perfect buddha Kāśyapa, right here in Rājagṛha, there lived five hundred non-Buddhists.

source: དེ་དག་སྐབས་བཙལ་བའི་བསམ་པས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ག་ལ་བ་དེར་དོང་ངོ་། །
en: With the thought of looking for opportunities, they went to see the perfect buddha Kāśyapa.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་འཁོར་བརྒྱ་ཕྲག་དུ་མས་བསྐོར་ཏེ་མདུན་གྱིས་བྱས་ནས་ཆོས་སྟོན་ཅིང་བཞུགས་སོ། །
en: At that time the Blessed One, the perfect buddha Kāśyapa was with a retinue of several hundreds of thousands of people who sat before him as he taught the Dharma.

source: དེ་ན་མུ་སྟེགས་ཅན་ལྔ་བརྒྱ་ཙམ་པོ་དེ་དག་གིས་ཀྱེ་མའོ། །
en: At that time the five hundred non-Buddhists said, ‘Oh my!

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ནི་སྙན་པ་གསུང་བའོ་ཞེས་དད་པའི་སེམས་གཅིག་རྙེད་ནས་དེ་དག་འཆི་བའི་དུས་བྱས་སོ། །
en: The perfect buddha Kāśyapa speaks so pleasantly!’ After attaining a moment of trust in this way, they passed away.

source: དེ་དག་རྒྱུ་དེས་དགའ་ལྡན་གྱི་ལྷའི་རིས་སུ་སྐྱེས་པ་ནས་རྒྱུ་དེ་ཉིད་ཀྱིས་རིམ་གྱིས་ངའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ།
en: As a result of that trust they were born into the class of gods that live in the Heaven of Joy, and through that very cause they gradually became ordained within my teaching and

source: ཟག་པ་ཟད་པ་རྗེས་སུ་ཐོབ་པའི་བར་དུའོ། །
en: eventually attained the exhaustion of defilements.

source: རིགས་ཀྱི་བུ་ངས་མངོན་པར་ཤེས་ཏེ། གང་གི་ཕྱིར་དེ་བཞིན་གཤེགས་པས་འོད་ཟེར་གང་གིས་སེམས་ཅན་དམྱལ་བར་སྐྱེས་པའི་སེམས་ཅན་རྣམས་སེམས་ཅན་དམྱལ་བ་ནས་འབྱུང་བར་འགྱུར་བའི་འོད་ཟེར་བཀྱེ་བས་དེས་སེམས་ཅན་དམྱལ་བར་སྐྱེས་པའི་སེམས་ཅན་རྣམས་ལ་རེག་ནས་སེམས་ཅན་དམྱལ་བའི་གནོད་པའི་སྡུག་བསྔལ་ཐམས་ཅད་རྒྱུན་ཆད་དེ་བདེ་བ་དང་ལྡན་པར་གྱུར་ནས
en: “Noble son, I clearly see that the Thus-Gone One sends forth light rays to free those beings who are born in hell from their hellish states. As the light touches those beings who have been born in hell, it interrupts all the suffering that pains those beings in hell and brings them happiness.

source: དེ་དག་འདི་སྙམ་དུ་གང་གིས། བདག་ཅག་སེམས་ཅན་དམྱལ་བའི་གནོད་པའི་སྡུག་བསྔལ་ཐམས་ཅད་རྒྱུན་བཅད་ནས་བདེ་བ་དང་ལྡན་པར་གྱུར་པ་
en: This causes them to think, ‘Whose strength has interrupted all the suffering that pains us beings in hell and instead brought us happiness?’

source: འདི་སུའི་མཐུ་སྙམ་པ་དང་། དེ་བཞིན་གཤེགས་པས་བྱིན་གྱིས་བརླབས་ནས་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་སྐུ་མཐོང་ངོ་། །
en: Then, through the blessing of the Buddha, they become able to see the Thus-Gone One’s body.

source: མཐོང་ནས་ཀྱེ་མའོ་གང་གིས་བདག་ཅག་གི་སེམས་ཅན་དམྱལ་བའི་གནོད་པའི་སྡུག་བསྔལ་ཐམས་ཅད་རྒྱུན་བཅད་ནས་བདེ་བ་དང་ལྡན་པར་གྱུར་པ་
en: As they behold the Buddha, they say, ‘This is the one whose strength has interrupted all the suffering that pains us beings in hell and brought us happiness!

source: དེའི་མཐུ་འདི་ནི་མཐུ་ཆེ་བའོ་སྙམ་སྟེ
en: His power is indeed great!’

source: དད་པའི་སེམས་གཅིག་རྙེད་ནས། དེ་དག་འཆི་བའི་དུས་བྱས་ཏེ་ཤི་འཕོས་ནས་
en: After attaining a moment of trust in this way, they pass away and transmigrate.

source: རྒྱུ་དེ་ཉིད་ཀྱིས་མཚུངས་པར་དེ་དག་ལྷར་སྐྱེས་པ་ནས་རིམ་གྱིས་རྒྱུ་དེ་ཉིད་ཀྱིས་ངའི་བསྟན་པ་ལ་དད་པ་རྙེད་དེ།
en: In accord with this cause they are born as gods and gradually obtain trust in my teaching.

source: ལ་ལ་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པས། ལ་ལ་ནི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: Some of them attain nirvāṇa through the vehicle of the hearers, some through the vehicle of the solitary buddhas,

source: ལ་ལ་ནི་ཐེག་པ་ཆེན་པོས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་གྱུར་ཏོ། །
en: and some become destined for unsurpassed and completely perfect awakening through the Great Vehicle.

source: རིགས་ཀྱི་བུ་རྣམ་གྲངས་འདིས་ངས་མངོན་པར་ཤེས་ཏེ། བགྲང་བ་ལས་འདས་པའི་སེམས་ཅན་དག་གང་གི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་སྲབ་ཅིང་ཆུང་བའི་སེམས་གཅིག་གིས་ཀྱང་ཁ་ཅིག་ནི་ངན་སོང་ལས་ལོག་པར་གྱུར།
en: “Noble son, again, I clearly see that when beings, who are beyond count, feel just a single moment of weak and inferior trust in the Great Vehicle of the Thus-Gone One,

source: ཁ་ཅིག་ནི་ཀུན་ནས་ཉོན་མོངས་པར་གྱུར་པའི་ལུས་ལས་ལོག་པར་གྱུར་ཏོ། །
en: some of them will be turned away from the lower realms, while some of them will be turned away from the body of defilement.

source: ལོག་ནས་ཀྱང་འཇིག་རྟེན་པའི་ཕུན་སུམ་ཚོགས་པ་རྗེས་སུ་ཐོབ་བོ། །
en: When they relinquish that, they also attain mundane excellence.

source: ཐེག་པ་ཆེན་པོ་ལ་དད་པའི་སེམས་སྲབ་ཅིང་ཆུང་བ་དེས་འཇིག་རྟེན་ལས་འདས་པའི་ཕུན་སུམ་ཚོགས་པའི་རྣམ་པ་ཐམས་ཅད་ཀྱང་རྗེས་སུ་ཐོབ་བོ། །
en: A weak and diminutive mind that trusts the Great Vehicle will also obtain all the excellence that is beyond the world.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་སྲབ་ཅིང་ཆུང་བ་གཅིག་གི་ཕན་ཡོན་ཡང་དེ་ལྟར་ཚད་མེད་ན་
en: “Noble son, even a single benefit—however weak and diminutive—of trust in the vehicle of the bodhisattvas can become limitless in this way.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་རྒྱུན་དུ་འབྱུང་ཞིང་ཆུ་བོ་ལྟར་འབབ་པའི་ཕན་ཡོན་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ
en: So what need is there to mention the benefits of a continuous and river-like trust in the vehicle of the bodhisattvas?

source: བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་ཡང་བརྗོད་པར་སླ་བ་མ་ཡིན་ནོ། །
en: They could hardly be listed, even if one had a trillion eons.”

source: བྱང་ཆུབ་སེམས་དཔའ་དད་པ་ཐབས་ཆེན་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then, the bodhisattva Great Skillful Trust said to the Blessed One,

source: བཅོམ་ལྡན་འདས་ཀྱིས་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་མོས་པས་སྤྱོད་པ་ལ་ཞུགས་པ་རྣམས་ལ་ཐེག་པ་ཆེན་པོ་ལ་དད་པའི་མཚན་ཉིད་ཕུན་སུམ་ཚོགས་པ་བསྟན་པ་དང་། སྐྱེ་བ་ཕུན་སུམ་ཚོགས་པ་བསྟན་པ་དང་། རབ་ཏུ་དབྱེ་བ་ཕུན་སུམ་ཚོགས་པ་བསྟན་པ་དང་། ཕན་ཡོན་ཕུན་སུམ་ཚོགས་པ་བསྟན་པ་ནི་ངོ་མཚར་ཏོ། །
en: “Blessed One, it is wonderful that, for those novice bodhisattvas who are engaged in inspired conduct, you have taught the perfect characteristics of the trust in the Great Vehicle along with the perfect ways that trust is developed, the perfect classifications of trust, and now also the perfect benefits.

source: བཅོམ་ལྡན་འདས་རྗེས་སུ་དཔག་པ་དང་། རྗེས་སུ་འཇུག་པ་འདིས་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་གི་ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པ་ཁྱད་པར་དུ་འཕགས་པ་ཚད་མ་མཆིས་པ་དག་ཀྱང་བརྗོད་པར་འགྱུར་རོ། །
en: Blessed One, if one contemplates and practices based on these teachings, then the perfect, exalted, and limitless qualities of other bodhisattvas will also become apparent.”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་སྟོང་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་མངོན་པར་རྟོགས་པའི་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཆེན་པོ་སྐྱེས་སོ། །
en: When the Blessed One delivered this Dharma teaching, five thousand novice bodhisattvas developed the great acceptance that facilitates realization of the Dharma of the bodhisattvas,

source: འཁོར་དེར་འདུས་པ་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལྷག་མ་རྣམས་ཀྱང་མོས་པ་ལས་མི་གཡོ་བའི་ཚུལ་གྱིས་མོས་པ་ཀླུང་དུ་བྱེད་པའི་བཟོད་པ་སྐྱེས་སོ། །
en: while in the assembled retinue the remainder of the novice bodhisattvas, through their unwavering aspiration, developed acceptance that is like a flowing river of aspiration.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ལ་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མོས་པ་སྔོན་དུ་བཏང་སྟེ། སྦྱོར་བར་བགྱིད་པ་ནི་རིང་པོ་མི་ཐོགས་པར་དེ་དག་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཞལ་ཟས་དང་། བཏུང་བ་དང་། བཞོན་པ་དང་། ན་བཟའ་དང་། རྒྱན་དང་། སྣོད་སྤྱད་དང་། འཚོག་ཆས་དང་། ཡོ་བྱད་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། གླུ་དང་། གར་དང་། རོལ་མོའི་དབྱངས་སྒྲ་དང་། མར་མེ་དང་། བུད་མེད་དང་། སྐྱེས་པ་དང་། ཀུན་སྤྱོད་པའི་ཡོ་བྱད་འཐོབ་པར་འགྱུར་རོ། །
en: “Blessed One, some bodhisattvas who have an initial interest in this Dharma teaching will, when applying it in practice, soon attain the thus-gone ones’ food, drink, mount, clothing, ornaments, utensils, necessities, goods, perfume, garlands, ointments, song, dance, music, light, women, men, and all enjoyable objects.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དད་པའི་སྣོད་ཡོངས་སུ་ཚོལ་བས་བྱང་ཆུབ་སེམས་དཔའ་དད་པ་ཐབས་ཆེན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then, the bodhisattva Searching for the Vessel of Trust said to the bodhisattva Great Skillful Trust,

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཞལ་ཟས་དང་། བཏུང་བ་དང་། བཞོན་པ་དང་། ན་བཟའ་དང་། རྒྱན་དང་། སྣོད་སྤྱད་དང་། འཚོག་ཆས་དང་། ཡོ་བྱད་གང་ཡིན།
en: “Noble son, what are the thus-gone ones’ food, drink, mount, clothing, ornaments, utensils, necessities, goods,

source: སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། གླུ་དང་། གར་དང་། རོལ་མོའི་དབྱངས་སྒྲ་དང་། མར་མེ་དང་། བུད་མེད་དང་། སྐྱེས་པ་དང་། ཀུན་སྤྱད་པའི་ཡོ་བྱད་གང་ཡིན།
en: perfume, garlands, ointments, song, dance, music, light, women, men, and all enjoyable objects?”

source: བྱང་ཆུབ་སེམས་དཔའ་དད་པ་ཐབས་ཆེན་གྱིས་སྨྲས་པ། རིགས་ཀྱི་བུ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པའི་བསམ་གཏན་གྱི་དགའ་བ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཞལ་ཟས་སོ། །
en: “Noble son,” the bodhisattva Great Skillful Trust replied, “the joy of concentration that is free from all obscurations is the thus-gone ones’ food.

source: སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པའི་དམ་པའི་ཆོས་ཀྱི་ཁུ་བ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བཏུང་བའོ། །
en: The fluid of the sacred Dharma that is free from obscurations is the thus-gone ones’ drink.

source: སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པའི་ཞི་གནས་དང་ལྷག་མཐོང་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བཞོན་པའོ། །
en: Tranquility and insight that are free from all obscurations are the thus-gone ones’ mount.

source: སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པའི་ངོ་ཚ་ཤེས་པ་དང་། ཁྲེལ་ཡོད་པ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ན་བཟའོ། །
en: Conscientiousness and modesty that are free from all obscurations are the thus-gone ones’ clothing.

source: སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པའི་རྒྱན་དང་བཅས་པའི་ཚུལ་ཁྲིམས་རྣམ་པར་དག་པ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་རྒྱན་ནོ། །
en: Pure discipline that is free from all obscurations is the thus-gone ones’ ornaments.

source: སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པའི་མང་དུ་ཐོས་པ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྣོད་སྤྱད་དང་། འཚོག་ཆས་དང་ཡོ་བྱད་དོ། །
en: Learning that is free from all obscurations is the thus-gone ones’ utensils, necessities, and goods.

source: སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པའི་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་རྣམས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པའོ། །
en: Concentrations, freedoms, absorptions, and states of equilibrium that are free from all obscurations are the thus-gone ones’ perfume, garlands, and ointments.

source: སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པའི་ཆོས་ཀྱི་རྫོགས་པར་ལོངས་སྤྱོད་པ་འབེལ་བའི་གཏམ་རྣམ་པར་གདོན་མི་ཟ་བ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་གླུ་དང་། གར་དང་། རོལ་མོའི་དབྱངས་སྒྲའོ། །
en: An indubitable discourse that contains the enjoyment of the complete Dharma that purifies all obscurations is the thus-gone ones’ song, dance, and music.

source: སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པའི་གཟུངས་ཀྱི་སྒོ་རྣམས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་མར་མེའོ། །
en: The gates of recollection that are free from all obscurations are the thus-gone ones’ light.

source: སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་རྣམས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བུད་མེད་དང་། སྐྱེས་པ་དང་། ཀུན་སྤྱོད་པའི་ཡོ་བྱད་དོ། །
en: The gates of absorption and the gates of liberation that are free from all obscurations are the thus-gone ones’ women, men, and all enjoyable objects.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མོས་པ་སྔོན་དུ་བཏང་སྟེ་
en: In this way, noble son, if by having an initial interest in this teaching and

source: སྦྱོར་བར་བྱེད་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཡོ་བྱད་བཅུ་པོ་འདི་དག་རིང་པོ་མི་ཐོགས་པར་ཀུན་རྫོབ་དང་། དོན་དམ་པར་ཡང་ཐོབ་པར་གྱུར་ན་གང་དག་འདི་ལ་དེ་བཞིན་ཉིད་དུ་སྦྱོར་བར་བྱེད་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ
en: applying its practices one soon attains these ten possessions of the thus-gone ones on the relative as well as the ultimate levels, there is no need to mention what happens for those who apply themselves to the reality behind this teaching.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཡོ་བྱད་བཅུ་པོ་འདི་དག་ཐོབ་པར་འགྱུར་བའི་སྟེང་དུ་དེ་དག་གིས་གཞལ་མེད་ཁང་གང་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་བཞུགས་པའི་གཞལ་མེད་ཁང་དེའང་ཐོབ་པར་འགྱུར་རོ། །
en: Noble son, on top of attaining these ten possessions of the thus-gone ones, they will also obtain the palace of the thus-gone ones as their residence.”

source: སྨྲས་པ།
en: The bodhisattva Searching for the Vessel of Trust said,

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་རྣམས་བཞུགས་པའི་གཞལ་མེད་ཁང་ཅི་འདྲ།
en: “Noble son, what is the palace in which the thus-gone ones reside like?”

source: བྱང་ཆུབ་སེམས་དཔའ་དད་པ་ཐབས་ཆེན་གྱིས་སྨྲས་པ།
en: The bodhisattva Great Skillful Trust said,

source: རིགས་ཀྱི་བུ་རིན་པོ་ཆེ་སྣ་བདུན་མཆོག་ཏུ་འབར་བ་བཀོད་པ་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་པ་རྒྱས་པར་འགེངས་པའི་འོད་ཟེར་ཆེན་པོ་ཤིན་ཏུ་འབྱུང་བ།
en: “Noble son, it is made of the shimmering seven precious substances and shines a light so bright that it pervades the endless extent of the world.

source: གནས་གཞན་དག་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་ཚད་མེད་པ།
en: It is distinguished from other locations in infinite ways.

source: རྣམ་པར་གཞག་པ་འཁོར་གྱི་ཁྱམས་ཡོངས་སུ་མ་ཆད་པ།
en: Its design is limitless and has no boundaries.

source: ཁམས་གསུམ་པ་ལས་ཡང་དག་པར་འདས་པའི་སྤྱོད་ཡུལ་གྱི་མཚན་ཉིད་འཇིག་རྟེན་ལས་འདས་པ་དེའི་བླ་མའི་དགེ་བའི་རྩ་བ་ལས་བྱུང་བ།
en: Its characteristics transcend the three realms, and it appears from the supreme roots of virtue that are beyond the world,

source: དབང་སྒྱུར་བའི་རྣམ་པར་རིག་པ། ཤིན་ཏུ་རྣམ་པར་དག་པའི་མཚན་ཉིད།
en: and from powerful cognition and the features of extreme purity.

source: དེ་བཞིན་གཤེགས་པའི་གནས། བྱང་ཆུབ་སེམས་དཔའ་དཔག་ཏུ་མེད་པ་གནས་པ།
en: Such is the abode of the thus-gone ones, which supports limitless bodhisattvas.

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་དཔག་ཏུ་མེད་པ་རྣམ་པར་རྒྱུ་བ།
en: It is teeming with boundless gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans.

source: ཆོས་ཀྱི་རོའི་དགའ་བ་དང་བདེ་བ་ཆེན་པོས་བརྟན་པ།
en: It is reinforced by the great joy and bliss of the taste of the Dharma.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་ཐམས་ཅད་མཛད་པས་ཉེ་བར་གནས་པ་ཉོན་མོངས་པ་དང་། ཉེ་བའི་ཉོན་མོངས་པའི་གནོད་པ་ཐམས་ཅད་དང་བྲལ་བ།
en: It is maintained by the activity of benefitting all beings and is free from any harm caused by disturbing emotions and subsidiary disturbing emotions.

source: བདུད་ཐམས་ཅད་ཡོངས་སུ་སྤངས་པ་ཐམས་ཅད་ཀྱི་བཀོད་པ་ལས་
en: It is inaccessible to any demon.

source: ལྷག་པ་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བཀོད་པ་དྲན་པ་དང་། བློ་གྲོས་དང་། རྟོགས་པ་ཆེན་པོས་ངེས་པར་འགྲོ་བ། ཞི་གནས་དང་ལྷག་མཐོང་ཆེན་པོའི་ཐེག་པ། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ཆེན་པོ་ནས་འཇུག་པའི་ཡོན་ཏན་གྱི་ཚོགས་ཚད་མེད་པས་བརྒྱན་པ།
en: Superior to all other structures, it is designed through the blessings of the thus-gone ones. Leading to liberation through mindfulness, intelligence, and great realization, it is the vehicle of tranquility and insight adorned with limitless masses of the qualities that emerge from great emptiness, absence of characteristics, and absence of wishes.

source: པད་མ་ཆེན་པོའི་རྒྱལ་པོས་བརྟན་པའི་གཞལ་མེད་ཁང་ཆེན་པོ་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་བཞུགས་ཏེ
en: The thus-gone ones reside in this great palace that sits atop the king of all great lotuses.

source: རིགས་ཀྱི་བུ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མོས་པ་སྔོན་དུ་བཏང་སྟེ།
en: Noble son, if whoever has an initial interest in this teaching will,

source: སྦྱོར་བར་བྱེད་པ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་གཞལ་མེད་ཁང་དེ་ལྟ་བུ་ཡང་ཐོབ་པར་གྱུར་ན།
en: by applying these practices, attain such a palace of the thus-gone ones,

source: གང་དག་དེ་བཞིན་ཉིད་དུ་སྦྱོར་བར་བྱེད་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་
en: there is no need to mention what happens for those who apply themselves to the reality behind this teaching.”

source: རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ། །
en: “Noble son, excellent, excellent!

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ཁྱོད་ཀྱིས་བཤད་པ་བཞིན་ཏེ།
en: Noble son, what you have said is true.

source: གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མོས་པ་སྔོན་དུ་བཏང་ནས་སྦྱོར་བར་བྱེད་པ་དེ་དག་རིང་པོར་མི་ཐོགས་པར་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཡོ་བྱད་འདི་དག་དང་། དེ་བཞིན་གཤེགས་པའི་གཞལ་མེད་ཁང་དེ་ཡང་ཐོབ་པར་འགྱུར་ན
en: If whoever forms an interest in this Dharma teaching will soon attain these possessions of the thus-gone ones and that palace of the thus-gone ones,

source: གང་དག་འདི་ལ་དེ་བཞིན་ཉིད་དུ་སྦྱོར་བར་བྱེད་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: there is no need to mention what occurs for those who apply themselves to the reality behind this teaching.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then, Venerable Ānanda spoke to the Blessed One:

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མོས་པ་དང་། ཀློག་པ་དང་། ཡི་གེར་འདྲི་བ་དང་། འདོན་པ་དང་། ཉན་པ་དང་། ཁ་ཏོན་བགྱིད་པ་དང་། གཞན་དག་ལའང་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་པ་དང་། ཚུལ་བཞིན་སེམས་པ་དང་། བསྒོམ་པའི་རྣམ་པས་སྦྱོར་བ་དེ་དག་བསོད་ནམས་ཇི་ཙམ་སྐྱེད་པར་འགྱུར།
en: “Blessed One, what kind of merit is created when a noble son or daughter feels interest in this Dharma teaching and reads, copies, recites, hears, chants, teaches, contemplates, or applies it through meditation?”

source: ཀུན་དགའ་བོ་གང་ལ་ལ་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མོས་པ་དང་། ཀློག་པ་དང་། ཡི་གེར་འདྲི་བ་དང་། འདོན་པ་དང་། ཉན་པ་དང་། ཁ་ཏོན་བྱེད་པ་དང་། གཞན་དག་ལའང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་དང་། ཚུལ་བཞིན་སེམས་པ་དང་། བསྒོམ་པའི་རྣམ་པས་སྦྱོར་བ་དེ་དག་ནི་བསོད་ནམས་གང་ལ་འཇིག་རྟེན་པའི་བསོད་ནམས་ཀྱི་རྣམ་པ་ཐམས་ཅད་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱི་བསོད་ནམས་འཇིག་རྟེན་ལས་འདས་པ། རྣམ་པ་ཐམས་ཅད་ཀྱི་དཔེར་ཡང་མི་བཟོད་པ་དེ་ལྟ་བུའི་བསོད་ནམས་སྐྱེད་པར་འགྱུར་རོ། །
en: “Ānanda, whoever feels interest in this Dharma teaching and reads, copies, recites, hears, chants, teaches elaborately and correctly, thoroughly contemplates, or applies it in meditation will create merit that is impossible to illustrate by any worldly merit or even by the merit of the hearers and solitary buddhas that transcends the world.
